Белгипрозем_2017/src/Documents/ИзменениеДатДоговоров/ИзменениеДатДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеДатДоговоров</name>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДатыДоговора</name>
    <type>
      <types>CatalogRef.мВидыДатДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановыйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Catalogs/мВидыДатДоговоров/мВидыДатДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мВидыДатДоговоров</name>
  <predefined>
    <items>
      <name>ДатаВозвратаДоговора</name>
      <description>Дата возврата договора</description>
    </items>
    <items>
      <name>ДатаВозобновленияРабот</name>
      <description>Дата возобновления работ</description>
    </items>
    <items>
      <name>ДатаВыполнения</name>
      <description>Дата выполнения</description>
    </items>
    <items>
      <name>ДатаЗакрытия</name>
      <description>Дата закрытия</description>
    </items>
    <items>
      <name>ДатаОплаты</name>
      <description>Дата оплаты</description>
    </items>
    <items>
      <name>ДатаПодписанияЗаказчиком</name>
      <description>Дата подписания заказчиком</description>
    </items>
    <items>
      <name>ДатаПредоставленияДокументов</name>
      <description>Дата предоставления документов</description>
    </items>
    <items>
      <name>ДатаПриостановленияРабот</name>
      <description>Дата приостановления работ</description>
    </items>
    <items>
      <name>ДатаПродления</name>
      <description>Дата продления</description>
    </items>
    <items>
      <name>ДатаРегистрации</name>
      <description>Дата регистрации</description>
    </items>
    <items>
      <name>ПлановыйСрок</name>
      <description>Плановый срок</description>
    </items>
  </predefined>
</mdclass:Catalog>

Белгипрозем_2017/src/Documents/ИзменениеДатДоговоров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.Основание);
	
	Если Не ЗначениеЗаполнено(Объект.Корреспондент) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Не заполнено поле ""Корреспондент""'"),,,"Корреспондент");
		Возврат;
	КонецЕсли;
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить("ВходящиеДокументы", "Входящие документы");
	СписокТипов.Добавить("ИсходящиеДокументы", "Исходящие документы");
	
	ВыбрЭлемент = СписокТипов.ВыбратьЭлемент();
	Если ВыбрЭлемент = Неопределено Тогда
	    Возврат;
	КонецЕсли; 
	
	Если ВыбрЭлемент.Значение = "ВходящиеДокументы" Тогда
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Отправитель", Объект.Корреспондент));
	Иначе
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Получатель", Объект.Корреспондент));
	КонецЕсли;
	
	ОткрытьФорму("Справочник."+ВыбрЭлемент.Значение+".ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДатыДоговораПриИзменении(Элемент)
	ЭтаФорма.Элементы.ЭтапыПлановыйСрок.Видимость = УстановитьВидимостьПлановогоСрока(Объект.ВидДатыДоговора);
КонецПроцедуры

&НаСервере
Функция УстановитьВидимостьПлановогоСрока(ВидДаты)
	Если ВидДаты = Справочники.мВидыДатДоговоров.ДатаПодписанияЗаказчиком ИЛИ
		ВидДаты = Справочники.мВидыДатДоговоров.ДатаВозвратаДоговора ИЛИ 
		ВидДаты = Справочники.мВидыДатДоговоров.ДатаВозобновленияРабот ИЛИ 
		ВидДаты = Справочники.мВидыДатДоговоров.ДатаПриостановленияРабот ИЛИ 
		ВидДаты = Справочники.мВидыДатДоговоров.ДатаПредоставленияДокументов Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура ДатаУстановленияПриИзменении(Элемент)
	Если УстановитьВидимостьПлановогоСрока(Объект.ВидДатыДоговора) Тогда
	    ЗаполнитьПлановыйСрок();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыйСрок()
	// для расчета срока - необходимо предварительно внести в регистр ДатыДоговоров данные этого документа
	
	Если Объект.Этапы.Количество() = 0 Тогда
	    Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	КонецЕсли; 
	
	Таблица = Документы.ИзменениеДатДоговоров.ИнициализироватьДанныеДокумента(Объект.Ссылка);
	мРаботаСДоговорами.ЗаписатьДатуДоговора(Таблица, Объект.Ссылка);
	
	ДатаСреза = КонецДня(Объект.Дата)+1;
	Для каждого СтрокаТаб Из Объект.Этапы Цикл
		
		СтрокаТаб.ПлановыйСрок = мРаботаСДоговорами.РассчитатьПлановыйСрокВыполненияДоговора(СтрокаТаб.ЭтапДоговора, ДатаСреза, Истина);
		
	КонецЦикла; 
	
	мРаботаСДоговорами.УдалитьДатуДоговора(Объект.Ссылка);
	
КонецПроцедуры // ЗаполнитьПлановыйСрок()
